# IPv4 101

## Setting an IP Address

```
R(config)#ip address IP-ADDR NETMASK
```

Any combination of IP-ADDR and NETMASK can be used as long as the **host **portion of the address is not all zeros. One exception is allowed, when using a /31 mask.\
By default, the router will accept combinations that result in a **subnet **portion of the address with all zeros, but this behavior can be disabled using:

```
R(config)#no ip subnet-zero
```

### Secondary IP Addresses

Multiple IP Addresses can be configured on an interface using the **secondary** keyword:

```
R(config-if)# ip address IP-ADDR NETMASK secondary
```

### IP Unnumbered

This feature allows a router to use the IP address of another interface instead of using a new IP Address. It can only be configured on point-to-point interfaces

```
R(config-if)# ip unnumbered INTERFACE
```
